#!/bin/bash
# Άσκηση 1 - Έλεγχος ενημέρωσης ιστοσελίδων

# Ορισμός συνάρτησης που δέχεται ως πρώτη παράμετρο μία ιστοσελίδα και επιτελεί το έργο του
#   ελέγχου για την ενημερώτητα αυτής.
check_website(){
    HS_RECORD=`grep "$1" $HSF` # Η γραμμή του αρχείου με το όνομα και τα παλιά δεδομένα της σελίδας
    
    WEBSITE_CONTENTS=`curl -s $1` 
    
    # Έλεγχος για το άν είναι δυνατή η ανάγνωση των περιεχομένων μιας ιστοσελίδας.
    # Αν η curl εκτελέστηκε και επέστρεψε 0, τότε είναι.
    if [ $? -eq 0 ]; then
            WBS_NEW_HST=`echo $WEBSITE_CONTENTS | md5sum | sed "s/\(.*\)  -.*/\1/"`
    else
            # Όταν δεν είναι δυνατή η ανάγνωση, αντί για το md5sum, έχω το string "[FAILED]" ως νέο ιστορικό σελίδας.
            WBS_NEW_HST='[FAILED]'
            # Εκτύπωση του μηνύματος σφάλματος
            echo $1 "FAILED" >&2
    fi
        
    # Αν δεν υπάρχει αναφορά της σελίδας στο ιστορικό και απέτυχε η ανάγνωση της, την αγνοώ.
    # Διαφορετικά
    if [ \( `echo "$HS_RECORD" | wc -c` -eq 1 \) -a \( "$WBS_NEW_HST" != '[FAILED]' \) ]; then
        # Εκτύπωση μηνύματος INIT και προσθήκη εγγραφής στο αρχείο ιστορικού.
        echo $1 "INIT"
        echo $1","$WBS_NEW_HST >> $HSF
    else
        # Απομόνωση md5sum παλιού ιστορικού, σύγκριση με το νέο και ενημέρωση του αρχείου ιστορικού.
        WBS_OLD_HST=`echo $HS_RECORD | cut -f 2 -d "," | tr -d '[:space:]'`
        if [ \( "$WBS_OLD_HST" != "$WBS_NEW_HST" \) -a \( "$WBS_NEW_HST" != '[FAILED]' \) ]; then
            # Η σελίδα ενημερώθηκε, τυπώνω τη διεύθυνση της σελίδας.
            echo $1
        fi
        sed -i "s|$1,.*|$1,$WBS_NEW_HST|g" "$HSF"
    fi
}

# Διαβάζω τις διευθύνσεις των ιστοσελίδων, διαγράφω τις διπλότυπες, 
#   διαγράφω τα σχόλια και κενές γραμμές από την είσοδο 
#   και εισάγω τους συνδέσμους των ιστοσελίδων σε array.
WEBSITES=(`sort $1 | uniq | sed "/^#.*$/d"| sed "/^$/d"`);

# Το όνομα του αρχείου με το "ιστορικό" της προηγούμενης έκδοσης κάθε σελίδας.
HSF=".history.txt";

# Αν δεν υπάρχει ήδη, δημιουργώ το αρχείο ιστορικού
if [ `ls -l | grep ".history.txt" | wc -l` -eq 0 ]; then
    touch $HSF;
fi

# Έλεγχος κάθε σελίδας.
for ws in "${WEBSITES[@]}"; do  
    check_website "$ws";
done
